services-tests/src/test/resources/payloads/isbn.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <IsValidISBN13 xmlns="http://webservices.daehosting.com/ISBN">
            <sISBN>%s</sISBN>
        </IsValidISBN13>
    </soap:Body>
</soap:Envelope>