src/test/resources/file/isvalidisbn10/isvalidisbn10.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:isbn="http://webservices.daehosting.com/ISBN">
    <soap:Header/>
    <soap:Body>
        <isbn:IsValidISBN10>
            <isbn:sISBN>[ISBN10]</isbn:sISBN>
        </isbn:IsValidISBN10>
    </soap:Body>
</soap:Envelope>